# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
# import libraries here
import numpy as np
import pandas as pd
from scipy import stats

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [ ]:
# your code here

#### Print `temp`.

In [ ]:
# your code here

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

#### Select the rows where state is New York.

In [ ]:
# your code here

#### What is the average temperature of cities in New York?

In [ ]:
# your code here

#### Which states and cities have a temperature above 15 degrees Celsius?

In [ ]:
# your code here

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [ ]:
# your code here

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [ ]:
# your code here

#### Find the mean and standard deviation of the temperature of each state.

In [ ]:
# your code here

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [10]:
# your code here
employees = pd.read_csv('Employee.csv')
employees.head(10)

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
6  Carlos         IT    Master      M         VP      8      70
7   Pedro         IT       Phd      M  associate      7      60
8     Ana         HR    Master      F         VP      8      70

#### Explore the data types of the `employees` dataframe. Comment your results.

In [11]:
# your code here
employees.dtypes

Name          object
Department    object
Education     object
Gender        object
Title         object
Years          int64
Salary         int64
dtype: object

In [16]:
employees.shape

(9, 7)

In [18]:
employees.columns

Index(['Name', 'Department', 'Education', 'Gender', 'Title', 'Years',
       'Salary'],
      dtype='object')

In [15]:
employees.describe()

          Years     Salary
count  9.000000   9.000000
mean   4.111111  48.888889
std    2.803767  16.541194
min    1.000000  30.000000
25%    2.000000  35.000000
50%    3.000000  55.000000
75%    7.000000  60.000000
max    8.000000  70.000000

In [ ]:
"""
It's a dataset about 9 employed people and 7 characteristics about the people. 
We have values to the variables: 'Name', 'Department', 'Education', 'Gender', 'Title', 'Years','Salary'
Modus for variable department is value IT
The mean salary is about 48.8 Eur - and the median is about 55.0 Eur
Minimum salary is about 30.00 Eur
The person who stayed longest in the company stayed for 8 years
Standard deviation is about 1 year wich is does not seam a lot
Standard deviation in salary is about 16.5 Eur

*in thousand
"""

#### What's the average salary in this company?

In [19]:
# your code here
employees.mean()

Years      4.111111
Salary    48.888889
dtype: float64

#### What's the highest salary?

In [23]:
# your code here
employees['Salary'].max()

70

#### What's the lowest salary?

In [24]:
# your code here
employees['Salary'].min()

30

#### Who are the employees with the lowest salary?

In [31]:
# your code here
employees[['Name','Salary']].sort_values(by=['Salary'], ascending=True)

     Name  Salary
1   Maria      30
2   David      30
0    Jose      35
3   Sonia      35
4  Samuel      55
5     Eva      55
7   Pedro      60
6  Carlos      70
8     Ana      70

#### Find all the information about an employee called David.

In [49]:
# your code here
employees[employees['Name']=="David"].index #.item()

Int64Index([2], dtype='int64')

In [48]:
employees.loc[2]

Name            David
Department         HR
Education      Master
Gender              M
Title         analyst
Years               2
Salary             30
Name: 2, dtype: object

#### Could you return only David's salary?

In [45]:
# your code here
employees.loc[[2],['Name','Salary']]

    Name  Salary
2  David      30

#### Print all the rows where job title is associate.

In [50]:
# your code here
employees[employees['Title']=="associate"]

     Name Department Education Gender      Title  Years  Salary
4  Samuel      Sales    Master      M  associate      3      55
5     Eva      Sales  Bachelor      F  associate      2      55
7   Pedro         IT       Phd      M  associate      7      60

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [51]:
# Method 1
# your code here
employees.head(3)

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

In [52]:
# Method 2
# your code here
employees.iloc[:3]

    Name Department Education Gender    Title  Years  Salary
0   Jose         IT  Bachelor      M  analyst      1      35
1  Maria         IT    Master      F  analyst      2      30
2  David         HR    Master      M  analyst      2      30

#### Find the employees whose title is associate and whose salary is above 55.

In [68]:
# your code here
x = (employees['Title']=="associate") & (employees['Salary']>55)
x

employees.loc[7]

Name              Pedro
Department           IT
Education           Phd
Gender                M
Title         associate
Years                 7
Salary               60
Name: 7, dtype: object

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [71]:
# your code here
employees.groupby(['Years'])['Salary'].mean()

Years
1    35.000000
2    38.333333
3    55.000000
4    35.000000
7    60.000000
8    70.000000
Name: Salary, dtype: float64

####  What is the average salary per title?

In [72]:
# your code here
employees.groupby(['Title'])['Salary'].mean()

Title
VP           70.000000
analyst      32.500000
associate    56.666667
Name: Salary, dtype: float64

####  Find the salary quartiles.

In [74]:
# your code here
employees['Salary'].quantile(0.25)   #25th Percentile

35.0

In [76]:
employees['Salary'].quantile(0.50)   #50th Percentile

55.0

In [75]:
employees['Salary'].quantile(0.75)   #75th Percentile

60.0

In [77]:
employees['Salary'].quantile(1)   #100th Percentile

70.0

#### Is the mean salary different per gender?

In [78]:
# your code here
employees.groupby(['Gender'])['Salary'].mean()  # -> yes, it is different

Gender
F    47.5
M    50.0
Name: Salary, dtype: float64

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [81]:
# your code here - departement, year, salary

employees.groupby(['Department'])['Salary'].describe()

            count   mean        std   min    25%   50%   75%   max
Department
HR            3.0  45.00  21.794495  30.0  32.50  35.0  52.5  70.0
IT            4.0  48.75  19.311050  30.0  33.75  47.5  62.5  70.0
Sales         2.0  55.00   0.000000  55.0  55.00  55.0  55.0  55.0

In [83]:
employees.groupby(['Department'])['Years'].describe()

            count      mean       std  min   25%  50%   75%  max
Department
HR            3.0  4.666667  3.055050  2.0  3.00  4.0  6.00  8.0
IT            4.0  4.500000  3.511885  1.0  1.75  4.5  7.25  8.0
Sales         2.0  2.500000  0.707107  2.0  2.25  2.5  2.75  3.0

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [ ]:
# your code here

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [ ]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here